nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, LearnableWaveletPool, [64]] # 3-P2/4

  - [-1, 1, Blocks, [64, BasicBlock_LWGA, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock_LWGA, 2, 3, 'relu']] # 5
  - [-1, 1, Blocks, [256, BasicBlock_LWGA, 2, 4, 'relu']] # 6
  - [-1, 1, Blocks, [512, BasicBlock_LGL, 2, 5, 'relu']] # 7

head:
  - [-1, 1, GSConv, [256, 1, 1]]  # 8
  - [-1, 1, AIFI, [1024, 8]]     # 9
  - [-1, 1, GSConv, [256, 1, 1]]  # 10, Y5

  - [-1, 1, SNI, [2]] # 11 (Upsample Y5)
  - [6, 1, GSConv, [256, 1, 1]]  # 12
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, VoVGSCSPC, [256]]  # 14
  - [-1, 1, GSConv, [128, 1, 1]]   # 15, Y4


  - [-1, 1, SNI, [2]] # 16 (Upsample Y4)
  - [4, 1, FocusSPDConv, [128]] # 17 (P2 -> CCFM)
  - [[-1, -2, 5], 1, Concat, [1]] # 18
  - [-1, 1, CSPHyperOK, []] # 19
  - [-1, 3, VoVGSCSPC, [256]] # 20 (Out_P3)

  - [-1, 1, GSConvE, [256, 3, 2]] # 21
  - [[-1, 15], 1, Concat, [1]] # 22
  - [-1, 3, VoVGSCSPC, [256]] # 23
  - [-1, 1, GSConvE, [256, 3, 2]] # 24
  - [[-1, 10], 1, Concat, [1]] # 25
  - [-1, 3, VoVGSCSPC, [256]] # 26

  - [4, 1, GSConv, [256, 1, 1]] # 27
  - [[27, 20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 4]]